{
  "definicion": "La geometría es la rama de las matemáticas que estudia las propiedades y relaciones de los puntos, líneas, superficies y sólidos en el espacio.",
  
  "puntos_lineas_planos": {
    "punto": "Un punto indica una posición exacta en el espacio. No tiene dimensiones, solo ubicación.",
    "linea": "Una línea es una sucesión continua de puntos que se extiende indefinidamente en dos direcciones. Tiene longitud pero no ancho ni grosor.",
    "segmento": "Un segmento de línea es una parte de una línea delimitada por dos puntos extremos.",
    "rayo": "Un rayo es una línea que tiene un punto inicial y se extiende indefinidamente en una dirección.",
    "plano": "Un plano es una superficie bidimensional que se extiende indefinidamente en todas las direcciones."
  },

  "tipos_angulos": {
    "angulo": "Un ángulo es la figura formada por dos rayos que comparten un punto común llamado vértice.",
    "angulo_recto": "Un ángulo recto mide exactamente 90 grados.",
    "angulo_agudo": "Un ángulo agudo mide menos de 90 grados.",
    "angulo_obtuso": "Un ángulo obtuso mide más de 90 grados y menos de 180 grados.",
    "angulo_llano": "Un ángulo llano mide exactamente 180 grados."
  },

  "triangulos": {
    "definicion": "Un triángulo es una figura geométrica formada por tres lados y tres ángulos.",
    "clasificacion_lados": {
      "equilatero": "Todos sus lados son iguales.",
      "isosceles": "Tiene dos lados iguales.",
      "escaleno": "Todos sus lados son diferentes."
    },
    "clasificacion_angulos": {
      "acutangulo": "Tiene tres ángulos agudos.",
      "rectangulo": "Tiene un ángulo recto.",
      "obtusangulo": "Tiene un ángulo obtuso."
    },
    "propiedades": "La suma de los ángulos interiores de un triángulo siempre es 180 grados."
  },

  "cuadrilateros": {
    "definicion": "Un cuadrilátero es una figura con cuatro lados y cuatro ángulos.",
    "tipos": {
      "cuadrado": "Cuatro lados iguales y cuatro ángulos rectos.",
      "rectangulo": "Lados opuestos iguales y cuatro ángulos rectos.",
      "rombo": "Cuatro lados iguales, pero no necesariamente ángulos rectos.",
      "romboide": "Lados opuestos iguales y ángulos no rectos.",
      "trapecio": "Solo un par de lados paralelos."
    }
  },

  "poligonos": {
    "definicion": "Un polígono es una figura cerrada formada por segmentos de línea recta.",
    "clasificacion": {
      "regular": "Todos sus lados y ángulos son iguales.",
      "irregular": "Sus lados o ángulos no son iguales."
    },
    "formulas_area": {
      "general": "El área de un polígono regular se puede calcular usando la fórmula: (Perímetro × Apotema) / 2."
    }
  },

  "circunferencia_y_circulo": {
    "circunferencia": "La circunferencia es el conjunto de todos los puntos en un plano que están a una distancia fija (radio) de un punto dado llamado centro.",
    "circulo": "El círculo es la región del plano limitada por una circunferencia.",
    "elementos": {
      "radio": "Segmento que une el centro con cualquier punto de la circunferencia.",
      "diametro": "Segmento que pasa por el centro y une dos puntos de la circunferencia. Es el doble del radio.",
      "cuerda": "Segmento que une dos puntos cualquiera de la circunferencia.",
      "arco": "Parte de la circunferencia comprendida entre dos puntos.",
      "sector_circular": "Región del círculo limitada por dos radios y el arco comprendido entre ellos."
    },
    "formulas": {
      "perimetro": "El perímetro o longitud de la circunferencia es 2 × π × radio.",
      "area": "El área del círculo es π × radio²."
    }
  },

  "areas_y_perimetros": {
    "cuadrado": {
      "area": "Lado × Lado",
      "perimetro": "4 × Lado"
    },
    "rectangulo": {
      "area": "Base × Altura",
      "perimetro": "2 × (Base + Altura)"
    },
    "triangulo": {
      "area": "(Base × Altura) / 2",
      "perimetro": "Suma de los tres lados"
    },
    "circulo": {
      "area": "π × radio²",
      "perimetro": "2 × π × radio"
    }
  },

  "teorema_pitagoras": {
    "enunciado": "En un triángulo rectángulo, el cuadrado de la hipotenusa es igual a la suma de los cuadrados de los catetos.",
    "formula": "c² = a² + b²",
    "descripcion": "Donde 'c' es la hipotenusa y 'a' y 'b' son los catetos."
  },

  "volumenes": {
    "cilindro": {
      "volumen": "π × radio² × altura",
      "descripcion": "El volumen de un cilindro se calcula multiplicando el área de la base por la altura."
    },
    "cono": {
      "volumen": "(1/3) × π × radio² × altura",
      "descripcion": "El volumen de un cono es un tercio del volumen de un cilindro con la misma base y altura."
    },
    "esfera": {
      "volumen": "(4/3) × π × radio³",
      "descripcion": "El volumen de una esfera depende del radio al cubo multiplicado por (4/3)π."
    }
  }
}
